АПК/AccumulationRegisters/ОстаткиНаКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаКарте</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаименованиеТранзакции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

АПК/CommonModules/МодульБанковскойКартыСервер/Ext/Module.bsl
Функция ЗаписатьБалансКарты() Экспорт 

	БалансКарты = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНаКартеОстатки.НаименованиеТранзакции КАК НаименованиеТранзакции,
	|	ОстаткиНаКартеОстатки.Валюта КАК Валюта,
	|	ОстаткиНаКартеОстатки.СуммаСписанияОстаток КАК СуммаСписанияОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНаКарте.Остатки КАК ОстаткиНаКартеОстатки";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 		
		БалансКарты = БалансКарты + Выборка.СуммаСписанияОстаток;	
	КонецЦикла;
	
	Константы.БалансКарты.Установить(БалансКарты);
	
	Возврат БалансКарты;
	
КонецФункции
